# Taps
tap "homebrew/bundle"

# CLI / SDK — sempre última estável (sem @versão)
brew "git"
brew "git-lfs"
brew "gh"
brew "neovim"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "eza"
brew "starship"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "nvm"
brew "pnpm"
brew "yarn"
brew "maven"
brew "openjdk"
brew "rbenv"
brew "pipx"
brew "python"
brew "rust"
brew "watchman"
brew "supabase"
brew "ffmpeg"
brew "poppler"
brew "adb-enhanced"
brew "kdoctor"
brew "cocoapods"
brew "mas"
brew "shellcheck"

# Casks — apps GUI
cask "visual-studio-code"
cask "zed"
cask "dbeaver-community"
cask "bruno"
cask "iterm2"
cask "obsidian"
cask "google-chrome"
cask "discord"
cask "whatsapp"
cask "notion"
cask "microsoft-outlook"
cask "mongodb-compass"
cask "libreoffice"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-cascadia-code"
cask "font-inter"

# Android / mobile
cask "android-commandlinetools"
cask "android-platform-tools"
cask "flutter"
cask "ngrok"
